## Terraform Production Environment Planner
### :art: Terraform Format and Style 
Code formatted with status of `success` .

### :tada: Terraform Initialization
Terraform initialized with status of `success` .

### :white_check_mark: Terraform Validation
The terraform code has been validated with the status of `success` .
For more information on the validation output, please expand the details below.
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

### :memo: Terraform Plan
The terraform plan has been generated with the status of `success` .
For more information on the plan output, please expand the details below.
<details><summary>Show Plan</summary>

```

terraform
module.lambda_stack.data.aws_iam_policy.lambda_basic_execution_policy: Reading...
module.lambda_stack.aws_ecr_repository.this: Refreshing state... [id=complet_container_repository_prod]
module.lambda_stack.data.aws_iam_policy_document.lambda_assume_role: Reading...
module.lambda_stack.data.aws_iam_policy_document.lambda_assume_role: Read complete after 0s [id=2690255455]
module.lambda_stack.aws_api_gateway_rest_api.this: Refreshing state... [id=9lysjfotci]
module.lambda_stack.aws_iam_role.this: Refreshing state... [id=complet_lambda_function_role_prod]
module.lambda_stack.aws_ecr_lifecycle_policy.this: Refreshing state... [id=complet_container_repository_prod]
module.lambda_stack.null_resource.ecr_image: Refreshing state... [id=8706665939697840989]
module.lambda_stack.data.aws_iam_policy.lambda_basic_execution_policy: Read complete after 0s [id=arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]
module.lambda_stack.aws_lambda_function.this: Refreshing state... [id=complet_lambda_function_prod]
module.lambda_stack.aws_api_gateway_resource.this: Refreshing state... [id=qutcdi]
module.lambda_stack.aws_api_gateway_method.proxy_root: Refreshing state... [id=agm-9lysjfotci-8ziyoxchv0-ANY]
module.lambda_stack.aws_api_gateway_method.proxy: Refreshing state... [id=agm-9lysjfotci-qutcdi-ANY]
module.lambda_stack.aws_lambda_permission.apigw: Refreshing state... [id=AllowAPIGatewayInvoke]
module.lambda_stack.aws_api_gateway_integration.lambda: Refreshing state... [id=agi-9lysjfotci-qutcdi-ANY]
module.lambda_stack.aws_api_gateway_integration.lambda_root: Refreshing state... [id=agi-9lysjfotci-8ziyoxchv0-ANY]
module.lambda_stack.aws_api_gateway_deployment.this: Refreshing state... [id=1hitnp]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.lambda_stack.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/complet_lambda_function_prod"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # module.lambda_stack.aws_iam_role_policy_attachment.function_logging_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "function_logging_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "complet_lambda_function_role_prod"
    }

  # module.lambda_stack.aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "complet_lambda_function_prod"
      ~ image_uri                      = "027075156904.dkr.ecr.us-east-1.amazonaws.com/complet_container_repository_prod:9e051304838a2af354714585981b52a67d205deb" -> "027075156904.dkr.ecr.us-east-1.amazonaws.com/complet_container_repository_prod:74f79b901733e25d24bde3771d97eed6017ffb94"
      ~ last_modified                  = "2023-11-20T01:13:16.863+0000" -> (known after apply)
      ~ memory_size                    = 128 -> 2048
        tags                           = {}
      ~ timeout                        = 30 -> 60
        # (17 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_stack.null_resource.ecr_image must be replaced
+/- resource "null_resource" "ecr_image" {
      ~ id       = "8706665939697840989" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "dir_sha1" = "9e051304838a2af354714585981b52a67d205deb" -> "74f79b901733e25d24bde3771d97eed6017ffb94"
        }
    }

Plan: 3 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @damarals, Action: `pull_request`, Workflow: `Create terraform plan of the API infrastructure`*